{
    "Title": "House Lights",
    "Credits": ["Base code created by Adam Smith (amsmith@ucsc.edu)", "Story by Luan Ta (luta@ucsc.edu)."],
    "InitialLocation": "Living1",
    "Locations": {
        "Living1": {
            "Body": "After a night out with your friends, you get home. You discover that the lights do not work. You decide to check the circuit breaker in the basement but without a light source, it would be difficult to check. Unfortunately, your phone died an hour ago. You need to find a lightsource.",
            "Choices": [
                {
                    "Text": "Check Garage",
                    "Target": "Garage1"
                },
                {
                    "Text": "Check Basement",
                    "Target": "Base1"
                },
                {
                    "Text": "Check Car",
                    "Target": "Car1"
                }
            ]
        },
        "Garage1": {
            "Body":"You go in the garage. You somehow found a flashlight in the darkness. Good thing you remember where you left them. Unfortunately, it doesn't work when you tried to turn it on. Maybe the batteries are dead.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living1"
                },
                {
                    "Text": "Take Flashlight",
                    "Target": "Flash1"
                }
            ]
        },
        "Base1": {
            "Body": "You try for the basement, but it's too dark in there. You need a lightsource.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living1"
                }
            ]
        },
        "Car1": {
            "Body": "You go out the house to your car. You open the door. But wait, didn't you lock the car before you went in? Suspicious, you inspected the car. You found no one and nothing useful except for a pair of batteries.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living1"
                },
                {
                    "Text": "Take Batteries",
                    "Target": "Batt1"
                }
            ]
        },
        "Flash1": {
            "Body": "You take the flashlight.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living2"
                }
            ]
        },
        "Batt1": {
            "Body": "You take the batteries.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living3"
                }
            ]
        },
        "Living2": {
            "Body": "You are now back in the living room with a dead flashlight.",
            "Choices": [
                {
                    "Text": "Check Car",
                    "Target": "Car2" 
                },
                {
                    "Text": "Check Basement",
                    "Target": "Base2"
                }
            ]
        },
        "Base2": {
            "Body": "You try for the basement, but it's too dark in there. You need a lightsource. You only have a dead flashlight.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living2"
                }
            ]
        },
        "Car2": {
            "Body": "You go out the house to your car. You open the door. But wait, didn't you lock the car before you went in? Suspicious, you inspected the car. You found no one and nothing useful except for a pair of batteries.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living2"
                },
                {
                    "Text": "Take Batteries",
                    "Target": "Batt2"
                }
            ]
        },
        "Batt2": {
            "Body": "You take the batteries.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living4"
                }
            ]
        },
        "Living3": {
            "Body": "You are now back in the living room with a pair of batteries in your pocket. It might be useful, you thought.",
            "Choices": [
                {
                    "Text": "Check Garage",
                    "Target": "Garage2"
                },
                {
                    "Text": "Check Basement",
                    "Target": "Base3"
                }
            ]
        },
        "Base3": {
            "Body": "You try for the basement, but it's too dark in there. You need a lightsource. You only have batteries.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living3"
                }
            ]
        },
        "Garage2": {
            "Body": "You go in the garage. You somehow found a flashlight in the darkness. Good thing you remember where you left them. Unfortunately, it doesn't work when you tried to turn it on. Maybe the batteries are dead.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living3"
                },
                {
                    "Text": "Take Flashlight",
                    "Target": "Flash2"
                }
            ]
        },
        "Flash2": {
            "Body": "You take the flashlight.",
            "Choices": [
                {
                    "Text": "Go Back",
                    "Target": "Living4"
                }
            ]
        },
        "Living4": {
            "Body": "You are back in the living room with a flashlight that is now working with the fresh batteries.",
            "Choices": [
                {
                    "Text": "Fix The Lights",
                    "Target": "Fix"
                }
            ]
        },
        "Fix": {
            "Body": "You finally could go in the basement. You fix fuse and the lights came on. Suddenly, you hear your front door close.",
            "Choices": [
                {
                    "Text": "Go back up",
                    "Target": "Up"
                }
            ]
        },
        "Up": {
            "Body": "You go back to living room. Car keys are gone. You feel unease. You see outside your window and your car is still there. You don't feel safe checking the car without readying yourself with a weapon",
            "Choices": [
                {
                    "Text": "Get A Weapon",
                    "Target": "Weapon"
                }
            ]
        },
        "Weapon": {
            "Body": "You go to the garage once more to pick your weapon of choice: bat, brass knuckles, crowbar.",
            "Choices": [
                {
                    "Text": "Bat", 
                    "Target": "Bat"
                },
                {
                    "Text": "Brass Knuckles",
                    "Target": "Brass"
                },
                {
                    "Text": "Crowbar",
                    "Target": "Bar"
                }
            ]
        },
        "Bat": {
            "Body": "As you grasp the sturdy wooden bat, you feel a sense of reassurance in its weight. Confidently, you head towards the front door, ready to confront whoever may be lurking outside. Just as you reach for the doorknob, you hear a noise behind you. Turning quickly, you see a shadowy figure lunging at you from the darkness. Reacting swiftly, you swing the bat with all your strength, connecting with a satisfying thud. But before you can celebrate your victory, a sudden blow to the back of your head sends you into darkness.",
            "Choices": [
                {
                    "Text": "Continue",
                    "Target": "Continue"
                }
            ]
        },
        "Brass": {
            "Body": "You slip the brass knuckles over your fingers, their weight adding a sense of purpose to your clenched fists. With determination, you step outside, prepared to defend yourself against any potential threat. As you scan the surroundings, you catch a glimpse of movement near the bushes. Instinctively, you approach, ready to confront the intruder. Suddenly, a figure emerges, charging towards you with surprising speed. Without hesitation, you throw a punch, feeling the impact of metal against flesh. But as you revel in your brief triumph, a sudden blow from behind sends you spiraling into unconsciousness.",
            "Choices": [
                {
                    "Text": "Continue",
                    "Target": "Continue"
                }
            ]
        },
        "Bar": {
            "Body": "Gripping the cold metal of the crowbar, you feel a surge of adrenaline as you prepare to face whatever danger may lie outside. With cautious steps, you venture into the darkness, the crowbar held tightly in your grasp. As you reach the driveway, you notice movement near your car. With a mix of caution and determination, you approach, ready to defend yourself against any potential threat. Suddenly, a shadowy figure emerges from the darkness, lunging towards you with surprising agility. Reacting quickly, you swing the crowbar, the sound of metal meeting bone echoing through the night. But before you can fully comprehend what just happened, a sudden blow to the side of your head sends you tumbling into unconsciousness.",
            "Choices": [
                {
                    "Text": "Continue",
                    "Target": "Continue"
                }
            ]
        },
        "Continue": {
            "Body": "As you slowly regain consciousness in the back of the car, confusion clouds your thoughts. Your head throbs with pain, and you struggle to piece together what has happened. Sensing movement in the front seat, you turn to see a figure sitting behind the wheel.\n\n\"Are you okay?\" the driver asks, genuine concern evident in his voice.\n\nStill disoriented, you manage a weak affirmation before your mind races with questions. \"Who are you and why are you driving my car?\", you ask. Why can't you remember anything?\n\n\"How can you ask your friend a question like that?\" the driver continues, a hint of amusement in his tone. \"We were out all night, and you got pretty drunk. You asked me to drive you home.\"\n\nThe explanation seems plausible, but you can't shake the feeling of unease gnawing at you. However, you are too exhausted to push further, too weary to insist on confirming the driver's identity.\n\nNodding faintly, you mutter a response before sinking back into the seat, your eyelids heavy with fatigue. As the car continues its journey, you drift in and out of consciousness, the events of the night shrouded in mystery."
        }
    }
}